**Задание 1**

Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
film = pd.read_csv('movies.csv')

In [3]:
film.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
rating = pd.read_csv('ratings.csv')

In [5]:
rating.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [6]:
df = film.merge(rating, on = 'movieId')

In [7]:
df.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,2,3.5,1141415820
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3,4.0,1439472215
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,4,3.0,1573944252
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,858625949
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,8,4.0,890492517

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25000095 entries, 0 to 25000094
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   movieId    int64
 1   title      object
 2   genres     object
 3   userId     int64
 4   rating     float64
 5   timestamp  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 1.3+ GB

In [13]:
df[df.rating == 5]['title'].value_counts().head(1)

Shawshank Redemption, The (1994)    39553
Name: title, dtype: int64

**Задание 2**

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [15]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [32]:
power[ ((power['country'] == 'Latvia') | (power['country'] == 'Lithuania') | (power['country'] == 'Estonia')) 
      & ((power['category'] == 4) | (power['category'] == 12) | (power['category'] == 21)) 
      & (power['quantity'] > 0) 
      & ((power['year'] >= 2005) & (power['year'] <= 2010))]['quantity'].sum()

240580.0

**Задание 3**

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [37]:
kurs = pd.read_html('https://fortrader.org/quotes')[0]
kurs.head()

                           Название  Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  87.0       0.04          0.05        NaN
1       USDRUB Курс рубля к доллару  73.1       0.06          0.08        NaN

In [40]:
coin = pd.read_html('https://fortrader.org/quotes')[8]
coin.head()

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Bitcoin Курс биткоина,29 719.70,-1 936.70,-6.12000,NaN
1,Litecoin Курс лайткоин к доллару (LTC/USD),111.99,-12.99,-10.39000,NaN
2,BitcoinCash Курс Биткоин кеш к доллару США (BC...,405.62,-50.84,-11.14000,NaN
3,Dash Dash,109.49,-14.16,-11.45000,NaN
4,Ripple Ripple,0.53977,-0.06843,-11.25123,NaN